simulacoes/lombada/mhdCentralFoam/N=1,16/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;
    }

    "(h|e)"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
    
    B
    {
        $U
        preconditioner    DIC;
        //preconditioner    DILU;
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;//0.01;
        minIter         1;
    }
    
    "(pB.*)"
    {
        $U
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;//0.01;
        minIter         1;
    }
}

/*
pBPISO
{
    nCorrectors     10;  
}

relaxationFactors
{
    fields
    {   
    pB      0.3;
    }   
    equations
    {   
    }   
}
*/

// ************************************************************************* //
